**Table of contents**<a id='toc0_'></a>    
- [Short intro to NumPy](#toc1_)    
- [Introduction to Pandas Library](#toc2_)    
  - [Key Features of Pandas](#toc2_1_)    
  - [DataFrames and Series in Pandas](#toc2_2_)    
- [Dataframes in Pandas](#toc3_)    
  - [Creating DataFrames](#toc3_1_)    
    - [From Dictionaries](#toc3_1_1_)    
    - [From Lists of Lists](#toc3_1_2_)    
    - [From NumPy arrays](#toc3_1_3_)    
    - [From a file / URL](#toc3_1_4_)    
  - [DataFrame operations](#toc3_2_)    
    - [`head()` and `tail()`](#toc3_2_1_)    
    - [`index, columns and values`](#toc3_2_2_)    
  - [Data access in Dataframe](#toc3_3_)    
    - [Columns](#toc3_3_1_)    
    - [Rows](#toc3_3_2_)    
    - [Specific values](#toc3_3_3_)    
    - [‚ö†Ô∏è WARNING: Changing values in DataFrames ‚ö†Ô∏è (üî∞)](#toc3_3_4_)    
  - [More DataFrame Methods](#toc3_4_)    
    - [`shape`](#toc3_4_1_)    
    - [`describe()`](#toc3_4_2_)    
    - [`info()`](#toc3_4_3_)    
    - [`nunique() and unique()`](#toc3_4_4_)    
    - [`dtypes`](#toc3_4_5_)    
    - [`select_dtypes()`](#toc3_4_6_)    
    - [Aggregation such as `max()`](#toc3_4_7_)    
  - [üí° Check for understanding](#toc3_5_)    
- [Series in Pandas](#toc4_)    
  - [Creating Series](#toc4_1_)    
    - [From a list](#toc4_1_1_)    
    - [From a list with index](#toc4_1_2_)    
    - [From a dictionary](#toc4_1_3_)    
    - [From a file](#toc4_1_4_)    
  - [Data access in Series](#toc4_2_)    
  - [Methods in Series](#toc4_3_)    
    - [`concat()`](#toc4_3_1_)    
    - [`sort_values() and sort_index()`](#toc4_3_2_)    
    - [`value_counts()`](#toc4_3_3_)    
  - [üí° Check for understanding](#toc4_4_)    
- [Summary](#toc5_)    
- [Extra: Creating Dataframes from a Dictionary](#toc6_)    
- [Extra: pickle](#toc7_)    
  - [Saving DataFrames with Pickle](#toc7_1_)    
  - [Loading DataFrames from Pickle](#toc7_2_)    

<!-- vscode-jupyter-toc-config
	numbering=false
	anchor=true
	flat=false
	minLevel=1
	maxLevel=6
	/vscode-jupyter-toc-config -->
<!-- THIS CELL WILL BE REPLACED ON TOC UPDATE. DO NOT WRITE YOUR TEXT IN THIS CELL -->

In [97]:
# But first... how do we import libraries?
# from library import function
# import library
# import library as liby

In [3]:
%pip install numpy

Requirement already satisfied: numpy in d:\data_analyst\ironhack\anaconda\lib\site-packages (1.26.4)

# <a id='toc1_'></a>[Short intro to NumPy](#toc0_)

Let's start by mentioning NumPy as Pandas builds on top of NumPy.

NumPy is a powerful library for numerical computing in Python. It provides support for large, multi-dimensional arrays and matrices, along with an extensive collection of mathematical functions to operate on these arrays efficiently.

In [4]:
lst_ = [1, 2, 3, 4, 5]
lst_ * 2

[1, 2, 3, 4, 5, 1, 2, 3, 4, 5]

In [5]:
import numpy as np

# Creating a NumPy array
arr = np.array([1, 2, 3, 4, 5])

# Multiply by 2
arr * 2

array([ 2,  4,  6,  8, 10])

# <a id='toc2_'></a>[Introduction to Pandas Library](#toc0_)

<iframe src="https://giphy.com/embed/QoCoLo2opwUW4" width="480" height="278" frameBorder="0" class="giphy-embed" allowFullScreen></iframe><p><a href="https://giphy.com/gifs/panda-playing-QoCoLo2opwUW4">via GIPHY</a></p>

`pandas` is a powerful library designed for working with tabulated and tagged data, making it ideal for handling spreadsheets, SQL tables, and more. It revolves around two main data structures: `Series` and `DataFrames`.

## <a id='toc2_1_'></a>[Key Features of Pandas](#toc0_)

- Robust data import/export: `pandas` provides efficient tools to read and write data from various file formats like CSV, XLS, SQL, Parquet, SPSS, HDF5, and more.
- Data manipulation: With `pandas`, you can easily filter, add, or delete data, enabling seamless data processing.
- High-performance and versatility: It combines the performance of `numpy` arrays with the ability to handle tabulated data efficiently.

To import the necessary modules from the `pandas` library, we use the following syntax:

In [73]:
import pandas as pd  # 'pd' is the common abbreviation for pandas

![](https://github.com/data-bootcamp-v4/lessons/blob/main/img/pandas.svg?raw=true)

## <a id='toc2_2_'></a>[DataFrames and Series in Pandas](#toc0_)

In `pandas`, a `DataFrame` is a two-dimensional data structure that stores data in tabular form, with labeled rows and columns. Each row represents an observation, and each column represents a variable. `DataFrame` can handle heterogeneous data with different types (numeric, string, boolean, etc.). It also includes variable names, types, and methods to access and modify the data.

```python
# Creating a DataFrame
df = pd.DataFrame(data, ...)
```

On the other hand, a `Series` is a one-dimensional array of data with associated labels called the *index*. If no index is specified, it generates an ordered sequence of integers.

```python
# Creating a Series
s = pd.Series(data, index=index)
```

# <a id='toc3_'></a>[Dataframes in Pandas](#toc0_)

## <a id='toc3_1_'></a>[Creating DataFrames](#toc0_)

### <a id='toc3_1_1_'></a>[From Dictionaries](#toc0_)

A simple and common way to create a DataFrame is from a dictionary where keys are column names, and values are lists or arrays representing data for each column.

In [89]:
beatles_dict = {
    'name': ["John Lenon", "Paul McCartney", "George Harrison", "Ringo Starr", "Hanif Kantor"],
    'instrument': ["Vocals", "Bass", "Bass", "Drums", "Violin"],
    'tenure': [9, 12, 12, 8, 1],
    'num_fans': [9000, 2400, 2000, 1600, 6]
}
beatles_dict

{'name': ['John Lenon',
  'Paul McCartney',
  'George Harrison',
  'Ringo Starr',
  'Hanif Kantor'],
 'instrument': ['Vocals', 'Bass', 'Bass', 'Drums', 'Violin'],
 'tenure': [9, 12, 12, 8, 1],
 'num_fans': [9000, 2400, 2000, 1600, 6]}

In [75]:
beatles_df = pd.DataFrame(beatles_dict)
beatles_df

              name instrument  tenure  num_fans
0       John Lenon     Vocals       9      9000
1   Paul McCartney       Bass      12      2400
2  George Harrison       Bass      12      2000
3      Ringo Starr      Drums       8      1600
4     Hanif Kantor     Violin       1         6

In [15]:
# Check dtypes
pd.DataFrame(beatles_dict).loc[1]

name          Paul McCartney
instrument              Bass
tenure                    12
num_fans                2400
Name: 1, dtype: object

In [11]:
beatles_df = pd.DataFrame(beatles_dict)

In [12]:
type(beatles_df)

pandas.core.frame.DataFrame

In [13]:
beatles_df.dtypes

name          object
instrument    object
tenure         int64
num_fans       int64
dtype: object

### <a id='toc3_1_2_'></a>[From Lists of Lists](#toc0_)

You can also create a DataFrame from a list of lists. There are 2 ways this can happen:

- the records oriented lists (not very common):

In [25]:
data = [
    ["John Lenon", "Vocals", 9, 9000],
    ["Paul McCartney", "Bass", 12, 2400],
    ["George Harrison", "Bass", 12, 2000],
    ["Ringo Starr", "Drums", 8, 1600],
    ["Hanif Kantor", "Violin", 1, 6]
]

# Creating the DataFrame with specified column names
beatles_df = pd.DataFrame(data, columns=['Name', 'Instrument', 'Tenure (years)', 'Num Fans'])
beatles_df

              Name Instrument  Tenure (years)  Num Fans
0       John Lenon     Vocals               9      9000
1   Paul McCartney       Bass              12      2400
2  George Harrison       Bass              12      2000
3      Ringo Starr      Drums               8      1600
4     Hanif Kantor     Violin               1         6

- the columns oriented lists (much more common):

In [31]:
names = ["John Lenon", "Paul McCartney", "George Harrison", "Ringo Starr", "Hanif Kantor"]
instruments = ["Vocals", "Bass", "Bass", "Drums", "Violin"]
tenure = [9, 12, 12, 8, 1]
num_fans = [9000, 2400, 2000, 1600, 6]

# Initial DF
beatles_df = pd.DataFrame([names, instruments, tenure, num_fans] )
beatles_df

            0               1                2            3             4
0  John Lenon  Paul McCartney  George Harrison  Ringo Starr  Hanif Kantor
1      Vocals            Bass             Bass        Drums        Violin
2           9              12               12            8             1
3        9000            2400             2000         1600             6

In [32]:
# This is not a proper relational database so we need to spin it... or transpose it
beatles_df = beatles_df.T
beatles_df

                 0       1   2     3
0       John Lenon  Vocals   9  9000
1   Paul McCartney    Bass  12  2400
2  George Harrison    Bass  12  2000
3      Ringo Starr   Drums   8  1600
4     Hanif Kantor  Violin   1     6

In [83]:
beatles_df = pd.DataFrame({
    'Name': names,
    'Instrument': instruments,
    'Tenure': tenure,
    'Number of Fans': num_fans
})
beatles_df

              Name Instrument  Tenure  Number of Fans
0       John Lenon     Vocals       9            9000
1   Paul McCartney       Bass      12            2400
2  George Harrison       Bass      12            2000
3      Ringo Starr      Drums       8            1600
4     Hanif Kantor     Violin       1               6

### <a id='toc3_1_3_'></a>[From NumPy arrays](#toc0_)

Whilst it's possible to convert lists of lists into DataFrames, it's much more likely you'll be converting NumPy arrays to DataFrames instead so you can operate on them more easily:

In [29]:
data = np.array([
    ["John Lenon", "Vocals", 9, 9000],
    ["Paul McCartney", "Bass", 12, 2400],
    ["George Harrison", "Bass", 12, 2000],
    ["Ringo Starr", "Drums", 8, 1600],
    ["Hanif Kantor", "Violin", 1, 6]
])

# Creating the DataFrame with specified column names
beatles_df = pd.DataFrame(data, columns=['Name', 'Instrument', 'Tenure (years)', 'Num Fans'])
beatles_df

              Name Instrument Tenure (years) Num Fans
0       John Lenon     Vocals              9     9000
1   Paul McCartney       Bass             12     2400
2  George Harrison       Bass             12     2000
3      Ringo Starr      Drums              8     1600
4     Hanif Kantor     Violin              1        6

### <a id='toc3_1_4_'></a>[From a file / URL](#toc0_)

We will use `read_csv` to read data from a CSV file and create a DataFrame. (We can use parameter `usecols` and the method `squeeze("columns")` to create a Series instead - see Extra).

In [28]:
# Load Titanic dataset from an online source
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/titanic_train.csv'
titanic_df = pd.read_csv(url)

# Types of files
# excel (personally only recommend using Excel for client facing tables as it's heavier than .csv and can get messier)
# parquet (very large files, can be used in finance, retail, bioinformatics, etc.)
# JSON (typically used for website contents -> web scraping sessions)
# sql (when you have a connection with a local/cloud database)
# SPSS (from different scientific software, typically in survey settings)

## <a id='toc3_2_'></a>[DataFrame operations](#toc0_)

### <a id='toc3_2_1_'></a>[`head()` and `tail()`](#toc0_)

The `head()` method returns the first few rows of a DataFrame or Series, while the `tail()` method returns the last few rows.

In [30]:
# Default head and tail
display(titanic_df.head()) #the beginning of the file
titanic_df.tail()#the end of the file
#Nan = Not a number, we don't know about that data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [37]:
# Custom # of rows
display(titanic_df.head(3))
titanic_df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [38]:
# Print vs display for DataFrames
print(titanic_df.head(3))
display(titanic_df.head(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### <a id='toc3_2_2_'></a>[`index, columns and values`](#toc0_)

The `index` attribute in Pandas returns the index labels of a DataFrame or Series, and the `columns` attribute returns the column labels of a DataFrame.

In [39]:
titanic_df.index

RangeIndex(start=0, stop=891, step=1)

`RangeIndex(start=0, stop=1460, step=1)` is a special type of index in Pandas called a `RangeIndex`. It represents a range of integer values starting from 0, up to (but not including) 1460, with a step size of 1.

In [40]:
# Convert to list
list(titanic_df.index)

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 101,
 102,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 118,
 119,
 120,
 121,
 122,
 123,
 124,
 125,
 126,
 127,
 128,
 129,
 130,
 131,
 132,
 133,
 134,
 135,
 136,
 137,
 138,
 139,
 140,
 141,
 142,
 143,
 144,
 145,
 146,
 147,
 148,
 149,
 150,
 151,
 152,
 153,
 154,
 155,
 156,
 157,
 158,
 159,
 160,
 161,
 162,
 163,
 164,
 165,
 166,
 167,
 168,
 169,
 170,
 171,
 172,
 173,
 174,
 175,
 176,
 177,
 178,
 179,
 180,
 181,
 182,
 183,
 184,
 185,
 186,
 187,
 188,
 189,
 190,
 191,
 192,
 193,
 194,
 195,
 196,
 197,
 198,
 199,
 200,
 201,
 202,
 203,
 204,
 205,
 206,
 207,
 208,
 209,
 210,
 211,
 212,
 213,
 214,
 215,
 216,
 217,
 218,
 219,
 220,
 221,
 222,
 223,
 224,
 225,
 226,
 227,
 228,
 229,
 230,
 231,
 232,
 233,
 234,
 235,
 236,
 237,
 238,
 239,
 240,
 241,
 242,
 243,
 244,
 245,
 246,
 247,
 248,
 249,
 250,
 251,
 252,
 253,
 254,
 255,
 256,
 257,
 258,
 259,
 260,
 261,
 262,
 263,
 264,
 265,
 266,
 267,
 268,
 269,
 270,
 271,
 272,
 273,
 274,
 275,
 276,
 277,
 278,
 279,
 280,
 281,
 282,
 283,
 284,
 285,
 286,
 287,
 288,
 289,
 290,
 291,
 292,
 293,
 294,
 295,
 296,
 297,
 298,
 299,
 300,
 301,
 302,
 303,
 304,
 305,
 306,
 307,
 308,
 309,
 310,
 311,
 312,
 313,
 314,
 315,
 316,
 317,
 318,
 319,
 320,
 321,
 322,
 323,
 324,
 325,
 326,
 327,
 328,
 329,
 330,
 331,
 332,
 333,
 334,
 335,
 336,
 337,
 338,
 339,
 340,
 341,
 342,
 343,
 344,
 345,
 346,
 347,
 348,
 349,
 350,
 351,
 352,
 353,
 354,
 355,
 356,
 357,
 358,
 359,
 360,
 361,
 362,
 363,
 364,
 365,
 366,
 367,
 368,
 369,
 370,
 371,
 372,
 373,
 374,
 375,
 376,
 377,
 378,
 379,
 380,
 381,
 382,
 383,
 384,
 385,
 386,
 387,
 388,
 389,
 390,
 391,
 392,
 393,
 394,
 395,
 396,
 397,
 398,
 399,
 400,
 401,
 402,
 403,
 404,
 405,
 406,
 407,
 408,
 409,
 410,
 411,
 412,
 413,
 414,
 415,
 416,
 417,
 418,
 419,
 420,
 421,
 422,
 423,
 424,
 425,
 426,
 427,
 428,
 429,
 430,
 431,
 432,
 433,
 434,
 435,
 436,
 437,
 438,
 439,
 440,
 441,
 442,
 443,
 444,
 445,
 446,
 447,
 448,
 449,
 450,
 451,
 452,
 453,
 454,
 455,
 456,
 457,
 458,
 459,
 460,
 461,
 462,
 463,
 464,
 465,
 466,
 467,
 468,
 469,
 470,
 471,
 472,
 473,
 474,
 475,
 476,
 477,
 478,
 479,
 480,
 481,
 482,
 483,
 484,
 485,
 486,
 487,
 488,
 489,
 490,
 491,
 492,
 493,
 494,
 495,
 496,
 497,
 498,
 499,
 500,
 501,
 502,
 503,
 504,
 505,
 506,
 507,
 508,
 509,
 510,
 511,
 512,
 513,
 514,
 515,
 516,
 517,
 518,
 519,
 520,
 521,
 522,
 523,
 524,
 525,
 526,
 527,
 528,
 529,
 530,
 531,
 532,
 533,
 534,
 535,
 536,
 537,
 538,
 539,
 540,
 541,
 542,
 543,
 544,
 545,
 546,
 547,
 548,
 549,
 550,
 551,
 552,
 553,
 554,
 555,
 556,
 557,
 558,
 559,
 560,
 561,
 562,
 563,
 564,
 565,
 566,
 567,
 568,
 569,
 570,
 571,
 572,
 573,
 574,
 575,
 576,
 577,
 578,
 579,
 580,
 581,
 582,
 583,
 584,
 585,
 586,
 587,
 588,
 589,
 590,
 591,
 592,
 593,
 594,
 595,
 596,
 597,
 598,
 599,
 600,
 601,
 602,
 603,
 604,
 605,
 606,
 607,
 608,
 609,
 610,
 611,
 612,
 613,
 614,
 615,
 616,
 617,
 618,
 619,
 620,
 621,
 622,
 623,
 624,
 625,
 626,
 627,
 628,
 629,
 630,
 631,
 632,
 633,
 634,
 635,
 636,
 637,
 638,
 639,
 640,
 641,
 642,
 643,
 644,
 645,
 646,
 647,
 648,
 649,
 650,
 651,
 652,
 653,
 654,
 655,
 656,
 657,
 658,
 659,
 660,
 661,
 662,
 663,
 664,
 665,
 666,
 667,
 668,
 669,
 670,
 671,
 672,
 673,
 674,
 675,
 676,
 677,
 678,
 679,
 680,
 681,
 682,
 683,
 684,
 685,
 686,
 687,
 688,
 689,
 690,
 691,
 692,
 693,
 694,
 695,
 696,
 697,
 698,
 699,
 700,
 701,
 702,
 703,
 704,
 705,
 706,
 707,
 708,
 709,
 710,
 711,
 712,
 713,
 714,
 715,
 716,
 717,
 718,
 719,
 720,
 721,
 722,
 723,
 724,
 725,
 726,
 727,
 728,
 729,
 730,
 731,
 732,
 733,
 734,
 735,
 736,
 737,
 738,
 739,
 740,
 741,
 742,
 743,
 744,
 745,
 746,
 747,
 748,
 749,
 750,
 751,
 752,
 753,
 754,
 755,
 756,
 757,
 758,
 759,
 760,
 761,
 762,
 763,
 764,
 765,
 766,
 767,
 768,
 769,
 770,
 771,
 772,
 773,
 774,
 775,
 776,
 777,
 778,
 779,
 780,
 781,
 782,
 783,
 784,
 785,
 786,
 787,
 788,
 789,
 790,
 791,
 792,
 793,
 794,
 795,
 796,
 797,
 798,
 799,
 800,
 801,
 802,
 803,
 804,
 805,
 806,
 807,
 808,
 809,
 810,
 811,
 812,
 813,
 814,
 815,
 816,
 817,
 818,
 819,
 820,
 821,
 822,
 823,
 824,
 825,
 826,
 827,
 828,
 829,
 830,
 831,
 832,
 833,
 834,
 835,
 836,
 837,
 838,
 839,
 840,
 841,
 842,
 843,
 844,
 845,
 846,
 847,
 848,
 849,
 850,
 851,
 852,
 853,
 854,
 855,
 856,
 857,
 858,
 859,
 860,
 861,
 862,
 863,
 864,
 865,
 866,
 867,
 868,
 869,
 870,
 871,
 872,
 873,
 874,
 875,
 876,
 877,
 878,
 879,
 880,
 881,
 882,
 883,
 884,
 885,
 886,
 887,
 888,
 889,
 890]

In [41]:
# Review columns - data type is index!
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [42]:
# Convert to list
list(titanic_df.columns)

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In Pandas, `df.values` is an attribute that returns the underlying NumPy array of a DataFrame df. It represents the actual data stored in the DataFrame as a two-dimensional NumPy array.

In [43]:
# .values is useful when you use/create functions that need to handle either lists or arrays  
titanic_df.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)


Additionally, `Pandas` can create Dataframes from other sources, such as JSON, URL ...


---
## <a id='toc3_3_'></a>[Data access in Dataframe](#toc0_)

### <a id='toc3_3_1_'></a>[Columns](#toc0_)

You can extract columns from a `DataFrame` using dictionary-like notation or as attributes, obtaining a `Series` object in both cases, provided the column label is a valid Python identifier.

In [45]:
# dict way of accessing a column
titanic_df["Name"]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [46]:
# Check the data structure of the selected column
type(titanic_df["Sex"]) # Whenever we select a column, we get a Pandas Series

pandas.core.series.Series

In [48]:
# attribute access of the column
titanic_df.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [52]:
# This only works if the column name doesn't have unusual characters, this means no spaces or special characters
titanic_df['Passenger Id'] = titanic_df['PassengerId']
titanic_df.Passenger Id

SyntaxError: invalid syntax (3136390257.py, line 3)

In [55]:
titanic_df['Passenger Id'] = titanic_df['PassengerId']
titanic_df['Passenger Id']

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: Passenger Id, Length: 891, dtype: int64

In [53]:
# When we use a list instead of a string we get a DataFrame instead of a Series -> useful when that's the data structure you need
display(titanic_df[["Sex"]])
type(titanic_df[['Sex']])

        Sex
0      male
1    female
2    female
3    female
4      male
..      ...
886    male
887  female
888  female
889    male
890    male

[891 rows x 1 columns]

pandas.core.frame.DataFrame

In [57]:
col_list = ["Name", "SibSp", "Parch"]
titanic_df[col_list]

                                                  Name  SibSp  Parch
0                              Braund, Mr. Owen Harris      1      0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...      1      0
2                               Heikkinen, Miss. Laina      0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)      1      0
4                             Allen, Mr. William Henry      0      0
..                                                 ...    ...    ...
886                              Montvila, Rev. Juozas      0      0
887                       Graham, Miss. Margaret Edith      0      0
888           Johnston, Miss. Catherine Helen "Carrie"      1      2
889                              Behr, Mr. Karl Howell      0      0
890                                Dooley, Mr. Patrick      0      0

[891 rows x 3 columns]

In [ ]:
# Multiple objects
titanic_df[["Sex", "Fare"]]

### <a id='toc3_3_2_'></a>[Rows](#toc0_)

To access rows in a Pandas DataFrame, you can use the `iloc` attribute with integer-based indexing or the `loc` attribute with label-based indexing. For example, `df.iloc[0]` will access the first row, and `df.loc['row_label']` will access the row with the specified label.


<div class="alert alert-info">Note: Consult http://pandas.pydata.org/pandas-docs/version/0.18.1/indexing.html#different-choices-for-indexing to understand the differences between methods.</div>

Just for the sake of this example, we will create a dictionary with a non-default index.

![Table](../../../img/pd-indexing.png)

In [70]:
d_index = {
    "name": ["Paula", "Mark"],
    "score": [98.5, 95]
}

df_index = pd.DataFrame(d_index, index=["123A", "789B"])
df_index

       name  score
123A  Paula   98.5
789B   Mark   95.0


**loc** is used for label-based indexing to access rows.

In [60]:
df_index.loc["789B"]

name     Mark
score    95.0
Name: 789B, dtype: object


**iloc** is used for integer-based indexing in Pandas to access rows

In [61]:
df_index.iloc[1]

name     Mark
score    95.0
Name: 789B, dtype: object

In [63]:
df_index.iloc[:1]
#all line till the 1 one

       name  score
123A  Paula   98.5

### <a id='toc3_3_3_'></a>[Specific values](#toc0_)

Here's a summary of the different ways to access individual values in a Pandas DataFrame:

1. `df.loc[row_label][column_label]`: Chooses the row with the label and then the value in that row with the column label.

2. `df.iloc[row_position][column_label]`: Selects the row with the position and then the value in that row with the column label.

3. `df.loc[row_label, column_label]`: Directly accesses the value using both row and column labels.

4. `df.iloc[row_position, column_position]`: Directly accesses the value using both row and column positions.

Note: you might see `df[row_label][column_label]`, even though is less recommended that using `loc()`.

In [76]:
# Option 1 - names

# Step 1 - select the row
df_index.loc['123A']

# Step 2 - select the column
df_index.loc['123A']['name']

'Paula'

In [67]:
df_index.loc['name']['123A']
#Doesn't work as you start to read by the rows first

KeyError: 'name'

In [65]:
# Try Option 1 without loc
df_index['123A']['name']

KeyError: '123A'

In [99]:
# Option 2 - index, name

# Step 1 - select the row
df_index.iloc[0]

# Step 2 - select the column
# 2.a. Use column name
df_index.iloc[0]['name']

'Paula'

In [68]:
# 2.b. Use column index
df_index.iloc[0][0]

C:\Users\UTILISATEUR\AppData\Local\Temp\ipykernel_11840\452470934.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df_index.iloc[0][0]

'Paula'

In [71]:
# Try Option 2 without iloc
df_index[0][0]

KeyError: 0

### <a id='toc3_3_4_'></a>[‚ö†Ô∏è WARNING: Changing values in DataFrames ‚ö†Ô∏è (üî∞)](#toc0_)

In [104]:
# Get beatles names
new_beatles = beatles_df['Name']
new_beatles

0         John Lenon
1     Paul McCartney
2    George Harrison
3        Ringo Starr
4       Hanif Kantor
Name: Name, dtype: object

In [91]:
# Steal Hanif's place in the band
new_beatles[4] = 'sabina'
new_beatles

C:\Users\UTILISATEUR\AppData\Local\Temp\ipykernel_11840\3192329415.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_beatles[4] = 'sabina'

0         John Lenon
1     Paul McCartney
2    George Harrison
3        Ringo Starr
4             sabina
Name: name, dtype: object

In [92]:
beatles_df

              Name Instrument  Tenure  Number of Fans
0       John Lenon     Vocals       9            9000
1   Paul McCartney       Bass      12            2400
2  George Harrison       Bass      12            2000
3      Ringo Starr      Drums       8            1600
4     Hanif Kantor     Violin       1               6

In [107]:
# Use .copy() instead
new_beatles_df = beatles_df.copy()
new_beatles_series = new_beatles_df['Name']
new_beatles_series[4] = 'sabina'
new_beatles_df

C:\Users\UTILISATEUR\AppData\Local\Temp\ipykernel_11840\3063645431.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_beatles_series[4] = 'sabina'

              Name Instrument  Tenure  Number of Fans
0       John Lenon     Vocals       9            9000
1   Paul McCartney       Bass      12            2400
2  George Harrison       Bass      12            2000
3      Ringo Starr      Drums       8            1600
4           sabina     Violin       1               6

In [108]:
beatles_df

              Name Instrument  Tenure  Number of Fans
0       John Lenon     Vocals       9            9000
1   Paul McCartney       Bass      12            2400
2  George Harrison       Bass      12            2000
3      Ringo Starr      Drums       8            1600
4     Hanif Kantor     Violin       1               6


---
## <a id='toc3_4_'></a>[More DataFrame Methods](#toc0_)


Let's see some useful methods of the Dataframe class.

### <a id='toc3_4_1_'></a>[`shape`](#toc0_)

`shape` is a Pandas attribute that returns a tuple representing the dimensions of a DataFrame or Series, indicating the number of rows and columns, while `shape()` is not a valid function in Pandas, and attempting to call it will result in an AttributeError.

In [95]:
titanic_df.shape

(891, 13)

In [96]:
# No of cols
titanic_df.shape[1]

13

In [97]:
# No of rows
titanic_df.shape[0]

891

### <a id='toc3_4_3_'></a>[`info()`](#toc0_)

`info()` is a Pandas method that provides a concise summary of a DataFrame, including information about the data types, non-null values, and memory usage.

In [98]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   891 non-null    int64
 1   Survived      891 non-null    int64
 2   Pclass        891 non-null    int64
 3   Name          891 non-null    object
 4   Sex           891 non-null    object
 5   Age           714 non-null    float64
 6   SibSp         891 non-null    int64
 7   Parch         891 non-null    int64
 8   Ticket        891 non-null    object
 9   Fare          891 non-null    float64
 10  Cabin         204 non-null    object
 11  Embarked      889 non-null    object
 12  Passenger Id  891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

### <a id='toc3_4_2_'></a>[`describe()`](#toc0_)

`describe()` is a Pandas method that generates descriptive statistics of a DataFrame, providing information on count, mean, standard deviation, minimum, maximum, and quartiles for each numerical column.

In [110]:
titanic_df.describe().round(2) # By default looks only at numerical data

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Passenger Id
count,891.00,891.00,891.00,714.00,891.00,891.00,891.00,891.00
mean,446.00,0.38,2.31,29.70,0.52,0.38,32.20,446.00
std,257.35,0.49,0.84,14.53,1.10,0.81,49.69,257.35
min,1.00,0.00,1.00,0.42,0.00,0.00,0.00,1.00
25%,223.50,0.00,2.00,20.12,0.00,0.00,7.91,223.50
50%,446.00,0.00,3.00,28.00,0.00,0.00,14.45,446.00
75%,668.50,1.00,3.00,38.00,1.00,0.00,31.00,668.50
max,891.00,1.00,3.00,80.00,8.00,6.00,512.33,891.00

In [111]:
titanic_df.describe(include="object")

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [113]:
titanic_df.describe(include="all").round(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Passenger Id
count,891.00,891.00,891.00,891,891,714.00,891.00,891.00,891,891.00,204,889,891.00
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3,NaN
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S,NaN
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644,NaN
mean,446.00,0.38,2.31,NaN,NaN,29.70,0.52,0.38,NaN,32.20,NaN,NaN,446.00
std,257.35,0.49,0.84,NaN,NaN,14.53,1.10,0.81,NaN,49.69,NaN,NaN,257.35
min,1.00,0.00,1.00,NaN,NaN,0.42,0.00,0.00,NaN,0.00,NaN,NaN,1.00
25%,223.50,0.00,2.00,NaN,NaN,20.12,0.00,0.00,NaN,7.91,NaN,NaN,223.50
50%,446.00,0.00,3.00,NaN,NaN,28.00,0.00,0.00,NaN,14.45,NaN,NaN,446.00
75%,668.50,1.00,3.00,NaN,NaN,38.00,1.00,0.00,NaN,31.00,NaN,NaN,668.50
max,891.00,1.00,3.00,NaN,NaN,80.00,8.00,6.00,NaN,512.33,NaN,NaN,891.00

### <a id='toc3_4_4_'></a>[`nunique() and unique()`](#toc0_)

`nunique()` is a Pandas function that returns the number of unique elements in a Series or DataFrame, while `unique()` returns an array of unique elements in a Series or DataFrame.

In [ ]:
titanic_df.nunique() #number of unique values per column

In [ ]:
#see unique values of one column
titanic_df.Pclass.unique()

### <a id='toc3_4_5_'></a>[`dtypes`](#toc0_)

`dtypes` is a Pandas attribute that returns the data types of each column in a DataFrame, while `dtype` is a method that returns the data type of a single element in a Series or DataFrame.

In [ ]:
titanic_df.dtypes

### <a id='toc3_4_6_'></a>[`select_dtypes()`](#toc0_)

`select_dtypes()` is a pandas function used to filter columns in a DataFrame based on their data types. It allows you to select numeric, object (string), boolean, datetime, or categorical columns.

Syntax:
```python
DataFrame.select_dtypes(include=None, exclude=None)
```

- `include`: A list of data types or strings representing data types to include in the selection. If specified, only columns with these data types will be included.
- `exclude`: A list of data types or strings representing data types to exclude from the selection. If specified, columns with these data types will be excluded.

Example:
```python
# Assuming df is a DataFrame
numeric_columns = df.select_dtypes(include='number')
object_columns = df.select_dtypes(include='object')
```

In [ ]:
titanic_df.select_dtypes(include='number').head()

### <a id='toc3_4_7_'></a>[Aggregation such as `max()`](#toc0_)

In [ ]:
titanic_df.select_dtypes(include='number').max() #get the max for each numerical column in the df

In [ ]:
titanic_df.Fare.max() #get the max for one numerical column

 Just like `max()`, there are many methods that can be applied to either the entire dataframe or its individual columns.

## <a id='toc3_5_'></a>[üí° Check for understanding](#toc0_)

- a. Use the original titanic_df
- b. Select the `Sex` and `Fare` columns.
- c. Indicate how many different types of `Sex` there are.
- d. Indicate how many `Sex` of each type there are.
- e. Show a statistical summary of all the variables.
- f. Write some conclusions

In [146]:
# Your code here

### <a id='toc4_3_1_'></a>[`concat()`](#toc0_)

`concat()` is a pandas function used to concatenate and combine DataFrames along a specified axis, either vertically (rows, or axis 0):

In [147]:
missing_passenger_data = {
    'PassengerId': 4,
    'Survived': 0,
    'Pclass': 3,
    'Name': 'Mary Johnson',
    'Sex': 'female',
    'Age': None,          # Missing age
    'SibSp': 0,
    'Parch': 0,
    'Ticket': 'STON/O2. 3101283',
    'Fare': None,         # Missing fare
    'Cabin': None,        # Missing cabin
    'Embarked': 'S'
}

In [ ]:
# Convert to DataFrame directly
missing_passenger = pd.DataFrame(missing_passenger_data)

In [ ]:
# Convert to DataFrame via list
missing_passenger = pd.DataFrame([missing_passenger_data])
missing_passenger

In [ ]:
# Check shape before and after appending
print(titanic_df.shape)
titanic_df = pd.concat([titanic_df, missing_passenger], axis=0)
print(titanic_df.shape)

or horizontally (columns, or axis 1):

In [ ]:
# New column with First Name as a Series with index aligned to the DataFram
# This would usually come from a separate place but this time we are creating it
first_name_col = titanic_df['Name'].apply(lambda name: name.split(" ")[0].replace(",", ""))
first_name_col

In [ ]:
# Check shape before and after appending
print(titanic_df.shape)
titanic_df = pd.concat([titanic_df, first_name_col], axis=1)
print(titanic_df.shape)

By default `concat` keeps the original indexes. It does not restart the index by default, unless we specify `ignore_index=True`.

In [ ]:
titanic_df.loc[0] # we see we have two elements for index 0

In [ ]:
titanic_df_new_idx = pd.concat([titanic_df, missing_passenger],ignore_index=True)
titanic_df_new_idx

### `set_index()`

In [ ]:
# What column makes most sense as an index?
titanic_df.set_index('PassengerId')
titanic_df.head()

### <a id='toc4_3_2_'></a>[`sort_values() and sort_index()`](#toc0_)

`sort_values()` is a pandas DataFrame method that sorts the DataFrame based on specified column(s), while `sort_index()` sorts the DataFrame based on its index labels.

In [ ]:
# Quickly review the dataframe
titanic_df.head()

In [ ]:
# sort by age
titanic_df.sort_values(by='Age')

In [ ]:
# sort by fare
titanic_df.sort_values(by='Fare')

In [ ]:
# Sort descending by fare
titanic_df.sort_values(by="Fare", ascending=False) #to change the ordering type

In [ ]:
# Sort by index
titanic_df.sort_index(ascending=False)

Sort index or sort values does not change the series.
We can either save it again in the variable or we can use a paremeter
called **inplace**.

In [ ]:
# Check if we changed the df
titanic_df.head()

In [ ]:
# Change the df
titanic_df.sort_index(ascending=False, inplace=True)

# equivalent: titanic_df = titanic_df.sort_index(ascending=False)

In [ ]:
titanic_df.head() # the series has changed because we used 'inplace=True'

---
# <a id='toc4_'></a>[Series in Pandas](#toc0_)

`Series` are the basic component of a dataframe and is designed to store homogenous multivariable data, i.e. data of the same type, be it int, string, float, or datetime. It can be created from lists, dictionaries, or directly read from a file, similarly to dataframes.

## <a id='toc4_1_'></a>[Creating Series](#toc0_)

### <a id='toc4_1_1_'></a>[From a list](#toc0_)

Create a Series with default indexes from a list

In [ ]:
beatles = ["John Lennon", "Paul McCartney", "George Harrison", "Ringo Starr", "Hanif Kantor"]

# Create pandas series
beatles_series = pd.Series(beatles)
beatles_series

In [ ]:
type(beatles_series) #but careful, its still a pandas series

In [ ]:
beatles_series.dtype #this gives me the type of the elements inside the series
# this is an attribute (remember our lesson about classes)

We can also have numbers in the series:

In [ ]:
num_fans = [9000, 2400, 2000, "1600", 15]

# Create series
beatles_fans_series = pd.Series(num_fans)
beatles_fans_series

In [ ]:
# Remember... all Python functions are case-sensitive:
beatles_fans_series = pd.series(num_fans)

In [ ]:
# Correct series
beatles_fans_series = pd.series(num_fans)

In [ ]:
# Series data type
type(beatles_series)

In [ ]:
# Type of data inside the series - with and without print
beatles_fans_series.dtype

No need to worry about the number after `int`, it simply represents how many digits the number can store, in this case 64-bits. If you're curious about how these bits work (i.e. go down a rabbit hole), you can <a href="https://www.freecodecamp.org/learn/data-analysis-with-python/data-analysis-with-python-course/numpy-introduction-a">have a look at this video</a> from the FreeCodeCamp Data Analysis certification.

The `Series` have two attributes:` values` and `index`. The first is a `numpy array` that stores the data, and the second is an object that contains the indexes.

In [ ]:
beatles_series.values

In [ ]:
beatles_series.index

In Pandas, `Series.items()` is a method used to iterate over the elements of a Pandas Series. It returns an iterator that yields the index-label and corresponding value pairs of the Series.

In [ ]:
#items has tuples (index,value) so i need to iterate with two variables
# if i want the values separated, if not, i get the tuple in each
# iteration
for i in beatles_series.items() :
    print(i)

In [ ]:
for i, v in beatles_series.items() :
    print("index ", i)
    print("value ", v)

### <a id='toc4_1_2_'></a>[From a list with index](#toc0_)

When creating a `Series`, you can explicitly define an `array` index and pass it as an argument.


Creating series with defined indexes

In [ ]:
beatles = ["John Lennon", "Paul McCartney", "George Harrison", "Ringo Starr", "Hanif Kantor"]
num_fans = [9000, 2400, 2000, 1600, 15]

# Create series
beatles_fans_series = pd.Series(num_fans, index=beatles)
beatles_fans_series

### <a id='toc4_1_3_'></a>[From a dictionary](#toc0_)

In [49]:
# I could do a Beatles fans dict manually
beatles_fans = {
    "John Lennon": 9000, 
    "Paul McCartney": 2400,
    "George Harrison": 2000,
    "Ringo Starr": 1600,
    "Hanif Kantor": 15,
    }

beatles_fans_series = pd.Series(beatles_fans)
beatles_fans_series

In [ ]:
# Or I could use a dict comprehension # Zip function connects the 2 lists along the same index
beatles_fans = {beatle: num_fans for beatle, num_fans in zip(beatles, num_fans)}
beatles_fans

### <a id='toc4_1_4_'></a>[From a file](#toc0_)

`read_csv()` is a Pandas function used to read data from a CSV file and create a DataFrame.

When assigning one column in the parameter `usecols` and then calling the method `squeeze("columns")`, the result is a Series instead of a Dataframe

In [ ]:
# Load Titanic dataset from an online source
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/titanic_train.csv'
titanic_series = pd.read_csv(url, usecols=["Name"]).squeeze("columns")



---
## <a id='toc4_2_'></a>[Data access in Series](#toc0_)

Data access in Pandas can be achieved through either the categorical index or the internally generated numerical index.

### <a id='toc4_2_2_'></a>[Using the index label:](#toc0_)

In [ ]:
beatles_fans_series['Hanif Kantor']

### <a id='toc4_2_1_'></a>[Using Pandas internal index:](#toc0_)

In [ ]:
# One element
beatles_fans_series[0]

In [ ]:
# Multiple elements slicing
beatles_fans_series[1:4]

In [ ]:
# 1: - all from one 
beatles_fans_series[1:]

In [ ]:
# [1:5:2] - odd indexes
beatles_fans_series[1:5:2]

In [ ]:
# [::-1] - reversed
beatles_fans_series[::-1]



---
## <a id='toc4_3_'></a>[Methods in Series](#toc0_)

In [ ]:
titanic_series

Series have many of the same methods as pandas DataFrames:
- concat
- sort_values
- sort_index

However, as opposed to DataFrames, they don't require column names or axes to be explicitly mentioned:

### `concat()`

In [ ]:
missing_passengers = pd.Series(
    [
        "James Bennett",
        "Eleanor Smith (n√©e Roberts)",
        "Lillian Grey",
        "Henry Dawson",
        "Thomas Wills",
        "Ada Carter (n√©e Foster)",
        "Margaret Lane",
        "Charles Baldwin",
        "Beatrice Hollins",
        "Samuel Kline",
    ]
)
titanic_new_df = pd.concat([titanic_series, missing_passengers])
titanic_new_df

In [ ]:
# Try using axis=1
titanic_new_df = pd.concat([titanic_series, missing_passengers], axis=1)

### `sort_values()`

In [ ]:
titanic_series.sort_values()

### `sort_index()`

In [ ]:
titanic_series.sort_index()

### <a id='toc4_3_3_'></a>[`value_counts()`](#toc0_)

`value_counts()` is a Pandas function that returns a Series containing the counts of unique values in a Series or DataFrame.

In [ ]:
titanic_series.value_counts()

## <a id='toc4_4_'></a>[üí° Check for understanding](#toc0_)

In [ ]:
titanic_series

1. Get the column "Embarked" from the Titanic csv as a Pandas Series
2. Print the first value
3. Print the last 5 values
3. Append "NA" to the Series
3. Get the number of each Embarked type (number of repeated values)
3. Order the Series *descending*, and print the Embarked type most repeated in the Series

In [ ]:
# Your answer here

# <a id='toc5_'></a>[Summary](#toc0_)

- Pandas is a library designed for working with tabulated and tagged data, making it ideal for handling spreadsheets, SQL tables, and more, built on top of NumPy.
- DataFrames and Series are the two main data structures in Pandas.
- Series is a one-dimensional array of data with associated labels called the index, while DataFrame is a two-dimensional tabular data structure with labeled rows and columns.
- Data access in Series and DataFrame can be achieved using integer-based indexing (iloc), label-based indexing (loc), or dictionary-like notation for column access.
- Series and DataFrame have various methods, such as sort_values(), sort_index(), value_counts(), describe(), info(), nunique(), unique(), dtypes, and select_dtypes().

# <a id='toc6_'></a>[Extra: Creating Dataframes from a Dictionary](#toc0_)

In [ ]:
# Create a Dataframe from a dictionary with
# automatic indexes

d = {"state": ["Ohio", "Ohio", "California", "Nevada", "California"],
     "year": [2000, 2001, 2002, 2001, 2002],
     "avg": [1.5, 1.7, 3.6, 2.4, 1.9]
}

df = pd.DataFrame(d)
df


DataFrame from a dictionary of lists and indexes

In [ ]:
d_index = {
    "name": ["Paula", "Mark"],
    "score": [98.5, 95]
}

df_index = pd.DataFrame(d_index, index=["123A", "789B"])
df_index

# <a id='toc7_'></a>[Extra: pickle](#toc0_)

Pandas `pickle` function provides a convenient way to save and load Python objects, including DataFrames, to and from disk. Pickling allows you to serialize Python objects into a binary format, making it easy to store large datasets or complex data structures. It's a great tool for saving and restoring your work, especially when dealing with large datasets that might take a long time to process or recreate.

## <a id='toc7_1_'></a>[Saving DataFrames with Pickle](#toc0_)

You can use the `to_pickle()` method in pandas to save a DataFrame to a pickle file. This method takes the file path as an argument and creates a binary representation of the DataFrame, which is then saved to the specified file.

In [ ]:
import pandas as pd

# Assuming df is your DataFrame
df.to_pickle('data.pkl')

## <a id='toc7_2_'></a>[Loading DataFrames from Pickle](#toc0_)

To load a DataFrame from a pickle file, you can use the `read_pickle()` function in pandas. This function reads the binary data from the pickle file and converts it back into a DataFrame.

In [73]:
import pandas as pd

# Load DataFrame from pickle file
df = pd.read_pickle('data.pkl')

In [ ]:
df.head()